{"meta":{"title":"Yutian Li","subtitle":"","description":"This is a blog","author":"yutianli","url":"http://example.com","root":"/"},"pages":[{"title":"","date":"2023-11-12T13:57:17.686Z","updated":"2023-11-12T13:57:17.686Z","comments":true,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"下面写关于自己的内容"},{"title":"我的朋友们","date":"2023-11-12T14:12:35.187Z","updated":"2023-11-12T14:12:35.187Z","comments":true,"path":"friends/index.html","permalink":"http://example.com/friends/index.html","excerpt":"","text":""},{"title":"所有分类","date":"2023-11-12T13:58:14.537Z","updated":"2023-11-12T13:58:14.537Z","comments":true,"path":"categories/index.html","permalink":"http://example.com/categories/index.html","excerpt":"","text":""},{"title":"所有标签","date":"2023-11-12T13:58:39.851Z","updated":"2023-11-12T13:58:39.851Z","comments":true,"path":"tags/index.html","permalink":"http://example.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Diploma project","slug":"Diploma-project","date":"2023-10-20T15:36:35.000Z","updated":"2023-11-12T14:03:55.477Z","comments":true,"path":"2023/10/20/Diploma-project/","link":"","permalink":"http://example.com/2023/10/20/Diploma-project/","excerpt":"","text":"Abstract Today, with the rapid development of science and technology, virtual reality technology is no longer a strange subject, virtual reality technology has become the focus of domestic and foreign scientific research. The data glove is the most important device among these intelligent wearable devices in virtual reality. The data glove can not only accurately capture and collect the gesture information of human hands, but also timely process and transfer the gesture information to the upper computer, which is conducive to providing visual feedback. However, many data gloves on the market have problems such as low attitude sensor response rate, poor attitude signal acquisition effect, lack of stability, and high cost. This paper studies and designs a virtual reality hand motion capture system based on a flexible bending sensor and MPU-6050. The main contents include the following points: In this research, a flexible sensor was obtained by adding conductive carbon particles into polyester resin with a unique micro-crack structure after the polyester resin film formed. The finger bending deformation leads to an increase in the distance between carbon conductive particles, which reduces the conductivity of the bending sensor and leads to the increase of the resistance value of the bending sensor. Thus, by measuring the resistance value of the bending sensor, you can calculate the bending Angle of the finger. In addition, the built-in three-axis accelerometer of the six-axis sensor MPU-6050 can be used to measure the gravity acceleration components in three axial directions, and then the Euler Angle corresponding to the hand posture can be obtained through the relationship of trigonometric function. Since the leading resistance value of the bending sensor is in a linear relationship with the bending Angle, this study first calibrates the leading resistance value of the bending sensor and deduces the linear expression of the leading resistance value of the bending sensor and the bending Angle of the finger through the method of linear fitting. After the partial voltage signal is collected by the bending sensor, it enters the ADC port of the self-designed Arduino microcontroller. According to Kirchhoff’s law, the Angle of finger bending can be calculated using the voltage value collected. In addition, in order to meet the power supply requirements of different peripherals, this design also adopts the boost chip HX3242 and the buck chip XC6206 to design the lifting voltage circuit, which can make the system run statically. According to the IIC protocol, the three-axis gravity acceleration and quaternion of MPU-6050 are read respectively under the single chip computer program, and the Kalman filter algorithm of the DMP library is used to convert them into corresponding Euler Angle. The calculated finger angles and hand Euler Angle are formatted and encapsulated, and the Bluetooth module sends the data to the upper computer for analysis and posture display. The upper computer adopts the Unity3D visualization engine, which can give users clear and beautiful visual feedback by importing arm FBX files and a self-designed virtual reality environment. Unlike many data gloves in the market, although they can capture hand posture, they are expensive and difficult to wear. This design uses a low-cost flexible sensor and MPU-6050, which can achieve the same capture effect, and is small and easy to wear, which can greatly improve the popularity of data gloves. Key words: Data glove, Flexible sensor, MPU-6050, Unity3D","categories":[{"name":"硬件","slug":"硬件","permalink":"http://example.com/categories/%E7%A1%AC%E4%BB%B6/"}],"tags":[{"name":"C++","slug":"C","permalink":"http://example.com/tags/C/"},{"name":"Unity3D","slug":"Unity3D","permalink":"http://example.com/tags/Unity3D/"},{"name":"Arduino","slug":"Arduino","permalink":"http://example.com/tags/Arduino/"}],"author":"YutianLi"},{"title":"Hello World","slug":"hello-world","date":"2023-10-18T12:14:30.001Z","updated":"2023-10-18T12:14:30.001Z","comments":true,"path":"2023/10/18/hello-world/","link":"","permalink":"http://example.com/2023/10/18/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[{"name":"硬件","slug":"硬件","permalink":"http://example.com/categories/%E7%A1%AC%E4%BB%B6/"}],"tags":[{"name":"C++","slug":"C","permalink":"http://example.com/tags/C/"},{"name":"Unity3D","slug":"Unity3D","permalink":"http://example.com/tags/Unity3D/"},{"name":"Arduino","slug":"Arduino","permalink":"http://example.com/tags/Arduino/"}]}